posts/voidstrap-a-tui-void-linux-installator.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Voidstrap a tui void linux installator</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>Javier Pacheco</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Voidstrap a tui void linux installator</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgccd3292">VoidStrap installer.</a></li>
<li><a href="#org521414b">Usage:</a>
<ul>
<li><a href="#orgf528701">Running install.sh</a></li>
<li><a href="#org15fc9c2">Running postinstall.sh</a></li>
</ul>
</li>
<li><a href="#org88c4b0a">The custom.sh script</a></li>
<li><a href="#orgca79fe2">References:</a></li>
</ul>
</div>
</nav>
<p>

</p>
<div class="PREVIEW" id="orgbd629a1">
<p>
This is the first post of the 2024, this is a project that I am working on in the last
year, is a minimialist voidlinux instalator it is based in some recomendations in 
a guides that some friends of my have but "semiautomated".
</p>

</div>

<div id="outline-container-orgccd3292" class="outline-2">
<h2 id="orgccd3292">VoidStrap installer.</h2>
<div class="outline-text-2" id="text-orgccd3292">
<p>
A basic minimalist installer of <code>void-linux</code> with some packages to get ready to enjoy
this amazing GNU/Linux distribution.
</p>
</div>
</div>

<div id="outline-container-org521414b" class="outline-2">
<h2 id="org521414b">Usage:</h2>
<div class="outline-text-2" id="text-org521414b">
</div>
<div id="outline-container-orgf528701" class="outline-3">
<h3 id="orgf528701">Running install.sh</h3>
<div class="outline-text-3" id="text-orgf528701">
<p>
Download the iso, and once in root inside the live, git clone this repo:
(You need to update inside the iso and install <code>git</code>)
</p>

<p>
NOTE: there are 3 <code>branches:</code>
</p>
<dl class="org-dl">
<dt>main</dt><dd>This will install <code>void-musl</code>.</dd>
<dt>glibc</dt><dd>This will install <code>void-glibc</code>.</dd>
<dt>dual</dt><dd>This will install <code>void-glibc</code> dual boot with <code>Windows</code>.
<ul class="org-ul">
<li><b>This branch is tested only with <code>Windows</code>, I never try it with other distributions.</b></li>
<li>If you want musl you can change the link to the mirror in the <code>install.sh</code> script:</li>
</ul></dd>
</dl>
<pre class="example" id="org3957179">
- Change this in line 11:
export XBPS_ARCH=x86_64 &amp;&amp; xbps-install -Suy -R http://mirrors.servercentral.com/voidlinux/current -r /mnt \
- For this:
export XBPS_ARCH=x86_64-musl &amp;&amp; xbps-install -Suy -R http://mirrors.servercentral.com/voidlinux/current/musl -r /mnt \
</pre>

<div class="org-src-container">
<pre class="src src-shell">git clone https://git.disroot.org/jpacheco/voidstrap
<span class="org-builtin">cd</span> voidstrap
sh install.sh
</pre>
</div>

<p>
Once there the script will open <code>cfdisk</code>, and you need to format the HDD in this 
specific format:
</p>
<pre class="example" id="orga526026">
- /dev/sdX1 -&gt; as the boot partition.
- /dev/sdY2 -&gt; as the swap partition.
- /dev/sdZ3 -&gt; as the root partition.
</pre>

<p>
NOTE: Replace X,Y &amp; Z for your partition name.
I consider to have this structure of partition, but you can change it, but you must
change the code in <code>postinstall.sh</code> when the scripts make the <code>fstab</code> archive.
</p>

<p>
<b>Make sure you do a backup of your files before doing crazy things and trust anyone script</b>
</p>

<p>
When the <code>install.sh</code> script finish, you need to run the postinstall script located in <code>/root folder:</code>
</p>
</div>
</div>

<div id="outline-container-org15fc9c2" class="outline-3">
<h3 id="org15fc9c2">Running postinstall.sh</h3>
<div class="outline-text-3" id="text-org15fc9c2">
<p>
This script its going to create some configuration files, like: <code>fstab</code>, <code>rc.conf</code>,
change the password of <code>root</code>, and add user(s).
</p>

<div class="org-src-container">
<pre class="src src-shell">xchroot /mnt
</pre>
</div>

<p>
Then run the <code>chroot.sh</code> script.
</p>
<div class="org-src-container">
<pre class="src src-shell">sh /root/postinstall.sh
</pre>
</div>

<p>
When the <code>postinsall.sh</code> script finishes, you only need to reboot and enjoy your
<b>Void-Linux</b> distribution.
</p>

<p>
When it finish you need to run the <code>postinstall.sh</code> script, that is going to install
the <b>X server</b> and some other "necessary" packages.
</p>
</div>
</div>
</div>


<div id="outline-container-org88c4b0a" class="outline-2">
<h2 id="org88c4b0a">The custom.sh script</h2>
<div class="outline-text-2" id="text-org88c4b0a">
<p>
This is going to install my personal dotfiles, and a specific packages that I use:
</p>
<div class="org-src-container">
<pre class="src src-shell">sh /root/custom.sh
</pre>
</div>

<p>
But you can specify your dotfiles repositories and others that you require whit some parameters:
</p>

<pre class="example">
sh custom.sh -r https://codeberg.org/jpacheco/dotfiles # specify a repo url.
sh custom.sh -p otherprogfile.csv # especify a custom package archive to install.
sh custom.sh -b dev # especify the name of a custom branch in case of needed.
</pre>
</div>
</div>

<div id="outline-container-orgca79fe2" class="outline-2">
<h2 id="orgca79fe2">References:</h2>
<div class="outline-text-2" id="text-orgca79fe2">
<ul class="org-ul">
<li><a href="https://codeberg.org/jpacheco/voidstrap">Voidstrap.</a></li>
<li><a href="https://docs.voidlinux.org/">Voidlinux Documentation.</a></li>
<li><a href="https://git.disroot.org/tuxliban/tutoriales_void/src/branch/master/Gu%C3%ADas">Tuxliban guides.</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-01 Mon 14:34</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
